---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MatchlineTopPlane
source: html/67d23606-8c83-1a2d-e175-856223055470.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MatchlineTopPlane Property

"Top Constraint"

## Syntax (C#)
```csharp
public static ForgeTypeId MatchlineTopPlane { get; }
```